{
  "date": "2026-02-23",
  "narrative": "# One Nation remains the top-ranked political party by search interest, with an average score of 27.1 across the period from February 17 to February 23. This places it at the top of the rankings, ahead of the Liberal Party (average 14.7), Labor (average 7.1), and Greens (average 4.1).\n\nThe significant spike in One Nation's search interest on February 23, reaching a peak of 32, coincides with the release of polling data indicating that One Nation is leading in primary votes for the upcoming New South Wales state election one year ahead of time. This news headline, along with other recent spikes (e.g., 36 on January 9 and 67 on January 10), suggests a growing interest in the party's policies and potential electoral impact.\n\nThe positive sentiment towards One Nation is reflected in its query score (+0.07), which indicates a generally favorable public perception of the party, despite the high number of neutral responses. This sentiment could be attributed to the party's strong performance in recent polls and its ability to capture media attention with headlines such as \"Hanson is close to peak One Nation\" and \"The swing voters set to disrupt the next federal election.\"\n\nLooking ahead, it will be crucial for all parties to monitor these trends closely, especially given the upcoming state election. The Liberal Party's average score of 14.7 suggests a strong performance in public interest, with notable spikes on February 12 (82) and February 13 (100). These spikes correlate with significant news coverage, such as the federal politics piece from the Australian Broadcasting Corporation discussing the Coalition's approach to IS-linked families. The positive sentiment towards the Liberal Party (+0.34) indicates a generally favorable public perception, which could be leveraged in their campaign strategies.\n\nOverall, the data suggests that One Nation is currently leading in search interest and may continue to gain traction as the election approaches, while the Liberal Party remains strong but faces challenges from other parties."
}